# Ex1 - Filtering and Sorting Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [90]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv).

### Step 3. Assign it to a variable called chipo.

In [91]:
chipotle_df = pd.read_table("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv")
chipotle_df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

### Step 4. How many products cost more than $10.00?

In [92]:
# chipotle_df['item_price'] = chipotle_df['item_price'].map(lambda x: float(x[1:]))
chipotle_df['item_price'] = (chipotle_df['item_price'].replace( '[^.0-9\-]','', regex=True).astype(float))

In [93]:
revmoved_dup = chipotle_df.drop_duplicates(subset=['item_name','quantity'])

In [94]:
filtered_by_one = revmoved_dup[revmoved_dup.quantity == 1]
filtered_by_one.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98

In [95]:
cost_more_than_ten = filtered_by_one.loc[filtered_by_one['item_price'] > 10]
cost_more_than_ten.head()

,order_id,quantity,item_name,choice_description,item_price
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",10.98
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.75
39,19,1,Barbacoa Bowl,"[Roasted Chili Corn Salsa, [Fajita Vegetables,...",11.75
57,26,1,Veggie Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",11.25
62,28,1,Veggie Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Rice,...",11.25

In [96]:
cost_more_than_ten.shape[0]

12

### Step 5. What is the price of each item? 
###### print a data frame with only two columns item_name and item_price

In [97]:
cost_more_than_ten[["item_name", "item_price"]]

                  item_name  item_price
5              Chicken Bowl       10.98
7             Steak Burrito       11.75
39            Barbacoa Bowl       11.75
57           Veggie Burrito       11.25
62              Veggie Bowl       11.25
168   Barbacoa Crispy Tacos       11.75
186       Veggie Salad Bowl       11.25
250           Chicken Salad       10.98
606        Steak Salad Bowl       11.89
738       Veggie Soft Tacos       11.25
1132    Carnitas Salad Bowl       11.89
1229    Barbacoa Salad Bowl       11.89

### Step 6. Sort by the name of the item

In [98]:
cost_more_than_ten[["item_name", "item_price"]].sort_values(by="item_name")

                  item_name  item_price
39            Barbacoa Bowl       11.75
168   Barbacoa Crispy Tacos       11.75
1229    Barbacoa Salad Bowl       11.89
1132    Carnitas Salad Bowl       11.89
5              Chicken Bowl       10.98
250           Chicken Salad       10.98
7             Steak Burrito       11.75
606        Steak Salad Bowl       11.89
62              Veggie Bowl       11.25
57           Veggie Burrito       11.25
186       Veggie Salad Bowl       11.25
738       Veggie Soft Tacos       11.25

### Step 7. What was the quantity of the most expensive item ordered?

In [99]:
chipotle_df.sort_values(by = "item_price", ascending = False).head(1)

,order_id,quantity,item_name,choice_description,item_price
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,44.25

### Step 8. How many times was a Veggie Salad Bowl ordered?

In [100]:
chipotle_df.loc[chipotle_df['item_name'] == "Veggie Salad Bowl"]. shape[0]

18

### Step 9. How many times did someone order more than one Canned Soda?

In [101]:
chipotle_df.loc[(chipotle_df['item_name'] == "Canned Soda") & (chipotle_df['quantity'] > 1)]. shape[0]

20